MESSAGES = {
    # ===== GENERAL =====
    "start": {
        "uk": "/subscribe - Підписатися на канал\n"
              "/language - Змінити мову\n"
              "/manage_subscription - Керувати підпискою\n"
              "/help - Список команд\n"
              "Лишилися питання? - Пиши @illia_gw",
        "en": "/subscribe - Subscribe to the channel\n"
              "/language - Change language\n"
              "/manage_subscription - Manage subscription\n"
              "/help - List of commands\n"
              "Any questions left? - Contact @illia_gw",
        "ru": "/subscribe - Подписаться на канал\n"
              "/language - Сменить язык\n"
              "/manage_subscription - Управление подпиской\n"
              "/help - Список команд\n"
              "Остались вопросы? - Пишите @illia_gw",
    },

    "help": {
        "uk": "/subscribe - Підписатися на канал\n"
              "/language - Змінити мову\n"
              "/manage_subscription - Керувати підпискою\n"
              "/help - Список команд\n"
              "Лишилися питання? - Пиши @illia_gw",
        "en": "/subscribe - Subscribe to the channel\n"
              "/language - Change language\n"
              "/manage_subscription - Manage subscription\n"
              "/help - List of commands\n"
              "Any questions left? - Contact @illia_gw",
        "ru": "/subscribe - Подписаться на канал\n"
              "/language - Сменить язык\n"
              "/manage_subscription - Управление подпиской\n"
              "/help - Список команд\n"
              "Остались вопросы? - Пишите @illia_gw",
    },

    "post": {
        "uk": "Заповніть інформацію про себе та відправте мені.\n"
              "Вашу анкету зможуть бачити роботодавці у нашому каналі WorkersEU "
              "де вона з'явиться після перевірки\n"
              "👤Ім’я:\n"
              "📱Контакти:\n"
              "🎂Вік:\n"
              "🪪Громадянство:\n"
              "👷‍♀️Спеціалізація:\n"
              "✅Досвід:\n"
              "🗣Мови:\n"
              "📄Документи:\n",
        "en": "Fill in your information and send to me.\n"
              "Employers will be able to see your profile in our WorkersEU channel "
              "where it will appear after review\n"
              "👤Name:\n"
              "📱Contacts:\n"
              "🎂Age:"
              "🪪Citizenship:\n"
              "👷‍♀️Specialization:\n"
              "✅Experience:\n"
              "🗣Languages:\n"
              "📄Documents:\n",
        "ru": "Заполните информацию о себе и отправьте мне.\n"
              "Вашу анкету смогут видеть работодатели в нашем канале WorkersEU "
              "где она появится после проверки\n"
              "👤Имя:\n"
              "📱Контакты:\n"
              "🎂Возраст:"
              "🪪Гражданство:\n"
              "👷‍♀️Специализация:\n"
              "✅Опыт:\n"
              "🗣Языки:\n"
              "📄Документы:\n",
    },

    "post_button": {
        "uk": "Опублікувати",
        "en": "Publish",
        "ru": "Опубликовать",
    },

    "post_info_is_saved": {
        "uk": "Текст збережено. Натисніть 'Опублікувати'.",
        "en": "Text is saved, pleas tap 'Publish'",
        "ru": "Текст сохранен, пожалуйста, нажмите 'Опубликовать'",
    },

    "no_post_info_id_send": {
        "uk": "Будь ласка, надішліть заповнену анкету",
        "en": "Please, send filled form",
        "ru": "Пожалуйста, отправьте заполненую форму",
    },

    "form_is_under_revision": {
        "uk": "Анкета відправлена на перевірку, дякую!",
        "en": "Your form is being checked by moderators, thank you for applying!",
        "ru": "Ваша анкета отправлена на проверку, спасибо!",
    },

    "creating_payment_link": {
        "uk": "⏳ Створюю посилання на оплату...",
        "en": "⏳ Creating payment link...",
        "ru": "⏳ Создаю ссылку на оплату...",
    },

    "generate_payment_link_anyway": {
        "uk": "Здається, я вже надсилав вам посилання на оплату. Якщо ви вже оплатили підписку - просто почекайте. Якщо посилання не прийшло, або виникли інші проблеми, натисніть кнопку знизу.",
        "en": "It seems I’ve already sent you the payment link. If you’ve already paid for the subscription, just wait. If you haven’t received the link or encountered any other issues, click the button below.",
        "ru": "Похоже, я уже отправил вам ссылку для оплаты. Если вы уже оплатили подписку — просто подождите. Если ссылка не пришла или возникли другие проблемы, нажмите кнопку ниже.",
    },

    "generate_anyway_button": {
        "uk": "Нове посилання на оплату",
        "en": "New payment link",
        "ru": "Новая ссылка на оплату",
    },
    
    "payment_link": {
        "uk": "Ваше посилання на оплату: <a href='{url}'>Оплатити підписку</a>",
        "en": "Your payment link: <a href='{url}'>Pay for the subscription</a>",
        "ru": "Ваша ссылка на оплату: <a href='{url}'>Оплатить подписку</a>",
    },

    "invite_link": {
        "uk": "Готово! Ваше запрошувальне посилання на канал: <a href='{url}'>Підписатися на канал</a>",
        "en": "All done! You invite link to the channel: <a href='{url}'>Subscribe to the channel</a>",
        "ru": "Готово! Ваше приглашение на канал: <a href='{url}'>Подписаться на канал</a>",
    },

    # ===== SUBSCRIPTIONS =====

    "manage_subscription": {
        "uk": "Ви можете керувати своєю підпискою за посиланням:\n{url}",
        "en": "You can manage your subscription here:\n{url}",
        "ru": "Вы можете управлять своей подпиской по ссылке:\n{url}"
    },

    "subscription_stopped": {
        "uk": "Ви успішно відмінили підписку. Шкода, що ви пішли — повертайтесь!",
        "en": "Your subscription has been successfully stopped. We’ll be happy to see you again!",
        "ru": "Вы успешно отменили подписку. Жаль, возвращайтесь!",
    },

    "subscription_stop_error": {
        "uk": "Сталася помилка під час відключення підписки. Спробуйте пізніше.",
        "en": "An error occurred while stopping the subscription. Please try again later.",
        "ru": "Произошла ошибка при отключении подписки. Пожалуйста, попробуйте позже.",
    },

    "subscription_ends_soon": {
        "uk": "Термін дії вашої підписки скоро закінчиться. Будь ласка, продовжіть її.",
        "en": "Your subscription will expire soon. Please renew it to keep access.",
        "ru": "Срок действия вашей подписки скоро закончится. Пожалуйста, продлите её.",
    },

    "subscription_ended": {
        "uk": "Термін дії вашої підписки закінчився. Доступ обмежено.",
        "en": "Your subscription has expired. Access is now restricted.",
        "ru": "Срок действия вашей подписки истёк. Доступ ограничен.",
    },

    "subscription_is_already_active": {
        "uk": (
            "У вас вже є активна підписка.\n"
            "Якщо хочете повернутись у канал — скористайтесь посиланням вище."
        ),
        "en": (
            "You already have an active subscription.\n"
            "If you want to rejoin the channel, use the link above."
        ),
        "ru": (
            "У вас уже есть активная подписка.\n"
            "Если хотите вернуться в канал — воспользуйтесь ссылкой выше."
        ),
    },

    "checkout_session_is_pending": {
        "uk": (
            "Використайте вже отримане посилання на оплату або "
            "зачекайте, поки платіж буде оброблено."
        ),
        "en": (
            "Please use the payment link you already received or "
            "wait until the payment is processed."
        ),
        "ru": (
            "Воспользуйтесь уже полученной ссылкой на оплату или "
            "подождите, пока платёж будет обработан."
        ),
    },

    "lang_changed": {
        "uk": "Чудово, будемо спілкуватися українською) Щоб знову змінити мову, будь ласка, натисніть /language",
        "en": "Great, let's talk in english:) To change language again, please, press /language",
        "ru": "Отлично, будем общаться на русском) Чтобы снова сменить язык, пожалуйста нажмите /language"
    },

    "commands": {
        "subscribe": {
            "uk": (
                "Підписатися на канал"
            ),
            "en": (
                "Subscribe to the channel"
            ),
            "ru": (
                "Подписаться на канал"
            ),
        },
        "language": {
            "uk": (
                "Оберіть мову"
            ),
            "en": (
                "Choose language"
            ),
            "ru": (
                "Выберите язык"
            ),
        }
    }
}
